Repository: boyan01/flutter-netease-music
Catalog: lib/l10n/intl_*.arb
Languages: pt, zh

source: My
pt: Meu
zh: 我的

source: Discover
pt: Descobrir
zh: 发现

source: Local Music
pt: Música local
zh: 本地音乐

# cloudMusic
source: Could Space
pt: Espaço da nuvem
zh: 云盘

# latestPlayHistory
source: Play History
pt: Histórico de reproduções
zh: 最近播放

source: Friends
pt: Amigos
zh: 我的好友

# collectionLike
source: Collections
pt: Coleções
zh: 已购

# alreadyBuy
source: Payed
pt: Pago (comprado)
zh: 收藏和赞

# playlistLoginDescription
source: Login to discover your playlists.
pt: conecte sua conta para descobrir suas listas de reprodução.
zh: 登录以加载你的私人播放列表。

source: Created Song List
pt: Lista de músicas criadas
zh: 创建的歌单

source: Favorite Song List
pt: Lista de músicas favoritas
zh: 收藏的歌单

# playlistShareContent
source: The PlayList created by {username}「{title}」: http://music.163.com/playlist/{playlistId}/{userId}/?userid={shareUserId} (From @NeteaseCouldMusic)
pt: Lista de reprodução criada por {username}「{title}」: http://music.163.com/playlist/{playlistId}/{userId}/?userid={shareUserId} (From @NeteaseCouldMusic)
zh: 分享{username}创建的歌单「{title}」: http://music.163.com/playlist/{playlistId}/{userId}/?userid={shareUserId} (来自@网易云音乐)

# shareContentCopied
source: Share content has copied to clipboard.
pt: Copiado para a área de transferência.
zh: 分享内容已复制到剪切板

source: error to fetch data.
pt: erro ao buscar dados.
zh: 获取数据失败

# selectRegionDiaCode
source: select region code
pt: Selecionar código de região
zh: 选择地区号码

source: next step
pt: próximo passo
zh: 下一步

source: login with phone
pt: conectar com celular
zh: 手机号登录

source: delete
pt: apagar
zh: 删除

# failedToDelete
source: delete failed
pt: falha ao apagar
zh: 删除失败

source: add to playlist
pt: adicionar a lista de reprodução
zh: 加入歌单

source: add to playlist failed
pt: falha ao adicionar a lista de reprodução
zh: 加入歌单失败

source: play in next
pt: Tocar na próxima
zh: 下一首播放

source: Skip login
pt: Não usar conta
zh: 跳过登录

# copyRightOverlay
source: Only used for personal study and research, commercial and illegal purposes are prohibited
pt: Usado apenas para estudo e pesquisa pessoal, usos comerciais e ilegais são proibidos
zh: 只用作个人学习研究，禁止用于商业及非法用途

# projectDescription
source: OpenSource project https://github.com/boyan01/flutter-netease-music
pt: Projeto de código aberto https://github.com/boyan01/flutter-netease-music
zh: 开源项目 https://github.com/boyan01/flutter-netease-music

source: Search
pt: Pesquisar
zh: 搜索

source: My Music
pt: Minhas Músicas
zh: 我的音乐

source: Personal FM
pt: FM personalizada
zh: 私人FM

source: failed to play music
pt: falha ao reproduzir música
zh: 播放音乐失败

source: no music
pt: sem músicas
zh: 暂无音乐

source: PlayList
pt: Lista de reprodução
zh: 歌单

source: failed to load
pt: Falha ao carregar
zh: 加载失败

source: Library
pt: Biblioteca
zh: 音乐库

source: Recommend PlayLists
pt: Listas de reprodução recomendadas
zh: 推荐歌单

# errorNotLogin
source: Please login first.
pt: Conectar uma conta primeiro.
zh: 未登录

# playlistPlayCount
source: Play Count: {value}
pt: Contagem de reproduções: {value}
zh: 播放数: {value}

source: Music Name
pt: Nome da música
zh: 音乐标题

source: Artists
pt: Artistas
zh: 歌手

source: Duration
pt: Duração
zh: 时长

source: Theme
pt: Tema
zh: 主题

# themeDark
source: Dark
pt: Escuro
zh: 深色主题

# themeLight
source: Light
pt: Claro
zh: 浅色主题

# themeAuto
source: Follow System
pt: Seguir o sistema
zh: 跟随系统

source: Settings
pt: configurações
zh: 设置

source: About
pt: Sobre
zh: 关于

source: Hide Copyright Overlay
pt: Ocultar sobreposição de direitos autorais
zh: 隐藏版权浮层

source: Track No Copyright
pt: Rastrear sem direitos autorais
zh: 此音乐暂无版权

source: No Lyric
pt: Sem letras
zh: 暂无歌词

source: Shortcuts
pt: Atalhos
zh: 快捷键

# playOrPause
source: Play/Pause
pt: Reproduzir/Pausar
zh: 播放/暂停

source: Skip to Next
pt: Pular para seguinte
zh: 下一首

source: Skip to Previous
pt: Pular para anterior
zh: 上一首

source: Volume Up
pt: Almentar volume
zh: 音量+

source: Volume Down
pt: Diminuir volume
zh: 音量-

source: Like Music
pt: Como música
zh: 喜欢歌曲

# functionDescription
source: Description
pt: Descrição
zh: 功能描述

# keySpace
source: Space
pt: Espaço
zh: 空格

source: Play
pt: Reproduzir
zh: 播放

source: Pause
pt: Pausar
zh: 暂停

source: Playing List
pt: Tocando lista
zh: 当前播放列表

source: Personal FM Playing
pt: Tocando FM personalizada
zh: 私人FM播放中

source: Play All
pt: Tocar tudo
zh: 全部播放

# musicCountFormat
source: {value} Music
pt: Música {value}
zh: 共{value}首

source: Select the artist
pt: Selecionar o artista
zh: 请选择要查看的歌手

# createdDate
source: Created at {value}
pt: Data de criação {value}
zh: {value}创建

source: Subscribe
pt: Se inscreva
zh: 收藏

source: Share
pt: Compartilhe
zh: 分享

# searchPlaylistSongs
source: Search Songs
pt: Pesquisar músicas
zh: 搜索歌单歌曲

# skipAccompaniment
source: Skip accompaniment when play playlist.
pt: Pule o acompanhamento ao reproduzir a lista de reprodução.
zh: 播放歌单时跳过包含伴奏的歌曲

source: Daily Recommend
pt: Recomendações díarias
zh: 每日推荐

# dailyRecommendDescription
source: Daily recommend music from Netease cloud music. Refresh every day at 06:00.
pt: Recomendar diariamente músicas de Netease. Atualiza todos os dias às 06:00.
zh: 网易云音乐每日推荐歌曲，每天 6:00 更新。

source: Current Playing
pt: Tocanto
zh: 当前播放

# searchMusicResultCount
source: Find {value} music
pt: Encontrar música {value}
zh: 找到 {value} 首歌曲

source: Songs
pt: Músicas
zh: 歌曲

# cloudMusicUsage
source: Cloud Usage
pt: Uso da nuvem
zh: 云盘容量

# cloudMusicFileDropDescription
source: Drop your music file to here to upload.
pt: Solte seu arquivo de música aqui para fazer upload.
zh: 将音乐文件拖放到这里进行上传

# artistAlbumCount
source: Album count: {value}
pt: Contagem de album: {value}
zh: 专辑数：{value}

source: Personal profile
pt: Perfil Pessoal
zh: 个人主页

source: Top Songs
pt: Principais músicas
zh: 热门歌曲

source: Show all hot songs >
pt: Mostrar todas as músicas quentes >
zh: 查看所有热门歌曲 >

source: Please input password
pt: Por favor digite a senha
zh: 请输入密码

source: Loading...
pt: carregando...
zh: 加载中...

# addedToPlaylistSuccess
source: Added to playlist successfully
pt: Adicionado a lista de reprodução com sucesso
zh: 已添加到播放列表

source: Clear Play History
pt: Limpar histórico de reprodução
zh: 清空列表

source: No play history
pt: Sem histórico de reprodução
zh: 暂无播放记录

source: Login via QR code
pt: Conectar via QR code
zh: 扫码登录

# loginViaQrCodeWaitingScanDescription
source: scan QR code by Netease cloud music mobile app
pt: Escanear QR code com o aplicativo para celular netEase cloud music
zh: 使用网易云音乐手机端扫码登录

# loginViaQrCodeWaitingConfirmDescription
source: Please confirm login via QR code in Netease cloud music mobile app
pt: Confirme a conexão via QR code no aplicativo para celular Netease cloud music
zh: 在网易云音乐手机端确认登录

source: QR code expired
pt: QR code expirado
zh: 二维码已过期

source: Recommend for you
pt: Recomendado para você
zh: 为你推荐

source: Logout
pt: Desconectar conta

source: Events
pt: Eventos

source: Follower
pt: Seguidor

source: Follow
pt: Seguir

source: Search History
pt: Histórico de pesquisa

source: Leaderboard
pt: Entre os melhores

# myDjs
source: Dj
zh: 我的电台

source: Login
zh: 立即登录

# albumShareContent
source: The {artistName}'s album《{albumName}》: http://music.163.com/album/{albumId}/?userid={sharedUserId} (From @NeteaseCouldMusic)
zh: 分享{artistName}的专辑《{albumName}》: http://music.163.com/album/{albumId}/?userid={sharedUserId} (来自@网易云音乐)

# playlistTrackCount
source: Track Count: {value}
zh: 歌曲数: {value}

source: Album
zh: 专辑
